const deinja = require("../src/deinja");

test("adjectiveTwoChar", () => {
  testDeinflections(
    "美しい",
    "美しく",
    "美しさ",
    "美しかった",
    "美しくありませんでした",
    "美しくありません",
    "美しかったら",
    "美しかったり",
    "美しかった",
    "美しくない",
    "美しすぎる",
    "美しければ",
    "美しくて",
    "美しそう"
  );
});

test("adjectiveOneChar", () => {
  testDeinflections(
    "軽い",
    "軽く",
    "軽さ",
    "軽かった",
    "軽くありませんでした",
    "軽くありません",
    "軽かったら",
    "軽かったり",
    "軽かった",
    "軽くない",
    "軽すぎる",
    "軽ければ",
    "軽くて",
    "軽そう"
  );
});

test("suru", () => {
  testDeinflections(
    "する",
    "しませんでした",
    "しません",
    "しましょう",
    "しました",
    "します",
    "しちゃう",
    "しちゃいます",
    "しちゃった",
    "しちゃえ",
    "しちゃおう",
    "しすぎる",
    "しなさい",
    "したら",
    "したり",
    "させる",
    "される",
    "しそう",
    "したい",
    "しない",
    "すれば",
    "しよう",
    "せず",
    "して",
    "した",
    "しなかった",
    "しなければ",
    "させられる",
    "させられた",
    "したければ",
    "したくなかった",
    "したい",
    "したかった"
  );
});

test("kuruHiragana", () => {
  testDeinflections(
    "くる",
    "きませんでした",
    "きません",
    "きましょう",
    "きました",
    "きます",
    "きちゃう",
    "きちゃいます",
    "きちゃった",
    "きちゃえ",
    "きちゃおう",
    "きすぎる",
    "きなさい",
    "きたら",
    "きたり",
    "こさせる",
    "こられる",
    "きそう",
    "きたい",
    "こない",
    "くれば",
    "こよう",
    "こず",
    "きて",
    "きた",
    "こなかった",
    "こなければ",
    "こさせられる",
    "こさせられた",
    "きたければ",
    "きたくなかった",
    "きたい",
    "きたかった"
  );
});

test("kuruKanji", () => {
  testDeinflections(
    "来る",
    "来ませんでした",
    "来ません",
    "来ましょう",
    "来ました",
    "来ます",
    "来ちゃう",
    "来ちゃいます",
    "来ちゃった",
    "来ちゃえ",
    "来ちゃおう",
    "来すぎる",
    "来なさい",
    "来たら",
    "来たり",
    "来させる",
    "来られる",
    "来そう",
    "来たい",
    "来ない",
    "来れば",
    "来よう",
    "来ず",
    "来て",
    "来た",
    "来なかった",
    "来なければ",
    "来させられる",
    "来させられた",
    "来たければ",
    "来たくなかった",
    "来たい",
    "来たかった"
  );
});

test("iku", () => {
  testDeinflections("いく", "いっちゃう", "いっちゃいます", "いっちゃった", "いっちゃえ", "いっちゃおう", "いったら", "いったり", "いって", "いった");
});

test("tou", () => {
  testDeinflections(
    "とう",
    "とうて",
    "とうた" //TODO: とうたり, etc.?
  );
});

test("kou", () => {
  testDeinflections(
    "こう",
    "こうて",
    "こうた" //TODO: こうたり, etc.?
  );
});

test("aisuru", () => {
  testDeinflections(
    "愛さざる",
    "愛さざるを得ない",
    "愛さず",
    "愛さずに",
    "愛さずとも",
    "愛させる",
    "愛させない",
    "愛させなかった",
    "愛させなくとも",
    "愛させなければ",
    "愛さない",
    "愛さなかった",
    "愛さなくとも",
    "愛さなければ",
    "愛さなかった",
    "愛さなかったら",
    "愛さなそう",
    "愛さば",
    "愛されざる",
    "愛された",
    "愛されたければ",
    "愛されたかった",
    "愛されちゃいそう",
    "愛されちゃう",
    "愛されちゃった",
    "愛されちゃっても",
    "愛されなければ",
    "愛されない",
    "愛されなかった",
    "愛されなかったら",
    "愛されなくとも",
    "愛されなければ",
    "愛されなさそう",
    "愛されなそう",
    "愛されたら",
    "愛されて",
    "愛されておく",
    "愛されとく",
    "愛されれば",
    "愛されれども",
    "愛されども",
    "愛される",
    "愛されるなら",
    "愛しそう",
    "愛した",
    "愛したい",
    "愛したなら",
    "愛したら",
    "愛したり",
    "愛しちゃいそう",
    "愛しちゃいます",
    "愛しちゃう",
    "愛しちゃえ",
    "愛しちゃおう",
    "愛しちゃおうが",
    "愛しちゃおうとも",
    "愛しちゃった",
    "愛しちゃっても",
    "愛しちゃっておく",
    "愛しちゃっとく",
    "愛して",
    "愛しておく",
    "愛しとく",
    "愛しとけば",
    "愛しな",
    "愛しなさい",
    "愛します",
    "愛すれども",
    "愛すれば",
    "愛する",
    "愛せし",
    "愛せず",
    "愛せずに",
    "愛せずとも",
    "愛せそう",
    "愛せない",
    "愛せなかった",
    "愛せなくとも",
    "愛せなければ",
    "愛せなさそう",
    "愛せなそう",
    "愛せば",
    "愛せど",
    "愛せども",
    "愛せよ",
    "愛せる",
    "愛せれば",
    "愛そう",
    "愛そうが",
    "愛そうと",
    "愛そうとも"
  );
});

test("doryokusuru", () => {
  testDeinflections(
    "努力しなさそう",
    "努力しなそう",
    "努力しよう",
    "努力しようが",
    "努力しようとも",
    "努力しろ",
    "努力せざる",
    "努力せざるを得ない"
  );
});

const testDeinflections = (base, ...args) => {
  for (let i = 0; i < args.length; i++) {
    const words = deinja.convert(args[i]);
    const found = words.find(w => w === base);
    expect(found).toBeTruthy();
  }
};
